#ООП
# class Person:
#     def __init__(self,name,age):
#         #Атрибуты класса
#         self.name = name
#         self.age = age
#         print(f"Account with name {self.name} created!")
#
#
#         #Метод класса
#     def walk(self):
#         print("I'm go for a walk")
#
#     def display_info(self):
#         print(f'Name: {self.name} Age: {self.age}')
#         #Деструктор класса
#     def __del__(self):
#         print(f"Account wi th name: {self.name} deleted!")
#
#
#
# def created_person():
#     tom = Person("Tom",43)
#
#
#
# created_person()
# print("Program ended")

#Прямоугольник, треугольник, круг: Напишите классы
# принимающий в конструкторе длину и ширину или радиус.
# Реализуйте метод area для вычисления площади и perimeter для периметра.
# Рефлексия и думать над проектами !!!


