#Павленко бот тренер анализу рынка (Геймификация?)
#1 как будите легализировать ваше решение
#2 много AI конкурентов ???
#3 предложение по реферальной ссылке финансирование
#4 много рисков с точки зрения закона
#5 На ком будет лежать ответственность?

#Чураков ИИ календарь
# 1 как бутите вести проект если гугл забанаят?
# 2 какая будет архитектура ИИ
# 3 Безопасность данных?
# 4 конкуренты AI менеджеры
# 5 стоймость ? из чего складывается
# 6 групповой чат ИИ офис

#ДЗ сделать презентацию ! К текущему докладу добавить -
# 1 анализ Рынка(аналоги),
# 2 дорожную карту развития проекта (Что и когда вы собираетесь делать),
# 3 экономику (ценообразование, стоймость разработки... )

