#Проектная ориентация
#Сфера действия вашего проекта Для чего или для кого создаётся ваш проект.
# 3 типа проектов
# А - проекты для центра талантов
# Б - СУЭК, СГК, ЕвроХим
# В - Общественно полезные проекты
# Важные категории для жизни людей - Комфорт, долгая и здоровая жизнь, расширение сфер влияния
# Экономика проекта - B to B, B to C, B to G
# представление проекта (5W)
# 1 Что? Что вы собираетесь делать?
# 2 Зачем этот продукт или изделие будут покупать ? Какую пользу принесёт проект обществу\компании\людям?
# 3 Где вы собираетесь реализовывать и продавать ваше изделие?
# 4 Будет ли сезонность выпуска продуктов? Когда вы сможете продавать ваш продукт? Ситуация которая приведёт к покупке ?
# 5 Кто? Кто будет покупать? Целевая аудитория ?
# ДЗ составить краткий доклад на тему своего проекта